src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://mustafasoyler.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserReguest>
            <us:name>Mustafa</us:name>
        </us:getUserReguest>
    </soapenv:Body>
</soapenv:Envelope>

